{"<PAD>": 0, "<UNK>": 1, "license": 2, "agreement": 3, "\n": 4, "this": 5, "(the": 6, "\"agreement\")": 7, "is": 8, "entered": 9, "into": 10, "as": 11, "of": 12, "30": 13, "october": 14, "2022": 15, "\"execution": 16, "date\"),": 17, "by": 18, "and": 19, "between": 20, "summit": 21, "bridge": 22, "capital": 23, "(\"party": 24, "a\")": 25, "titan": 26, "financial": 27, "services": 28, "b\"),": 29, "collectively": 30, "referred": 31, "to": 32, "the": 33, "\"parties.\"": 34, "recitals": 35, "whereas,": 36, "party": 37, "a": 38, "desires": 39, "engage": 40, "b": 41, "provide": 42, "intellectual": 43, "property": 44, "management": 45, "licensing;": 46, "qualified": 47, "willing": 48, "such": 49, "under": 50, "terms": 51, "set": 52, "forth": 53, "herein;": 54, "now,": 55, "therefore,": 56, "in": 57, "consideration": 58, "mutual": 59, "covenants": 60, "agreements": 61, "herein,": 62, "parties": 63, "agree": 64, "follows:": 65, "1.": 66, "effective": 67, "date": 68, "term": 69, "shall": 70, "become": 71, "on": 72, "13": 73, "november": 74, "\"effective": 75, "date\")": 76, "continue": 77, "full": 78, "force": 79, "until": 80, "2024-05-08,": 81, "unless": 82, "earlier": 83, "terminated": 84, "accordance": 85, "with": 86, "provisions": 87, "agreement.": 88, "2.": 89, "licensing": 90, "may": 91, "be": 92, "requested": 93, "from": 94, "time": 95, "time,": 96, "subject": 97, "conditions": 98, "3.": 99, "compensation": 100, "3.1": 101, "for": 102, "rendered,": 103, "agrees": 104, "pay": 105, "sum": 106, "$1,000,000": 107, "upon": 108, "execution": 109, "3.2": 110, "additional": 111, "$4,200,000": 112, "payable": 113, "satisfactory": 114, "completion": 115, "each": 116, "project": 117, "milestone": 118, "mutually": 119, "agreed": 120, "writing.": 121, "3.3": 122, "also": 123, "monthly": 124, "retainer": 125, "fee": 126, "$750,000": 127, "ongoing": 128, "advisory": 129, "throughout": 130, "4.": 131, "confidentiality": 132, "acknowledges": 133, "that": 134, "it": 135, "receive": 136, "confidential": 137, "proprietary": 138, "information": 139, "other": 140, "party.": 141, "maintain": 142, "all": 143, "not": 144, "disclose": 145, "any": 146, "third": 147, "without": 148, "prior": 149, "written": 150, "consent.": 151, "5.": 152, "work": 153, "product,": 154, "inventions,": 155, "deliverables": 156, "created": 157, "connection": 158, "considered": 159, "work-for-hire": 160, "exclusive": 161, "payment": 162, "fees.": 163, "6.": 164, "termination": 165, "immediately": 166, "material": 167, "breach": 168, "either": 169, "termination,": 170, "promptly": 171, "deliver": 172, "product": 173, "return": 174, "or": 175, "destroy": 176, "a.": 177, "7.": 178, "limitation": 179, "liability": 180, "no": 181, "event": 182, "liable": 183, "indirect,": 184, "incidental,": 185, "special,": 186, "exemplary,": 187, "consequential": 188, "damages,": 189, "however": 190, "caused,": 191, "even": 192, "if": 193, "advised": 194, "possibility": 195, "damages.": 196, "8.": 197, "governing": 198, "law": 199, "governed": 200, "construed": 201, "laws": 202, "state": 203, "texas,": 204, "regard": 205, "its": 206, "conflict": 207, "provisions.": 208, "9.": 209, "entire": 210, "constitutes": 211, "respect": 212, "matter": 213, "hereof": 214, "supersedes": 215, "understandings,": 216, "both": 217, "oral,": 218, "parties.": 219, "witness": 220, "whereof,": 221, "have": 222, "executed": 223, "first": 224, "above.": 225, "by:": 226, "_______________________": 227, "name:": 228, "____________________": 229, "title:": 230, "date:": 231, "master": 232, "2022-11-25": 233, "quantum": 234, "legal": 235, "solutions": 236, "global": 237, "trade": 238, "ventures": 239, "ltd.": 240, "mergers": 241, "acquisitions": 242, "due": 243, "diligence": 244, "services;": 245, "12/07/2022": 246, "2023-12-09,": 247, "$1,500,000": 248, "$675,000": 249, "$2,500,000": 250, "california,": 251, "service": 252, "03/07/2023": 253, "solaris": 254, "consulting": 255, "group": 256, "crestview": 257, "document": 258, "review": 259, "march": 260, "13,": 261, "2023": 262, "january": 263, "20,": 264, "2024,": 265, "$425,000": 266, "$300,000": 267, "$3,000,000": 268, "consent": 269, "new": 270, "york,": 271, "12/01/2020": 272, "pinnacle": 273, "asset": 274, "harbor": 275, "investments": 276, "compliance": 277, "regulatory": 278, "09": 279, "december": 280, "2020": 281, "2021-10-03,": 282, "reserves": 283, "right": 284, "terminate": 285, "convenience": 286, "forty-five": 287, "(45)": 288, "days": 289, "notice.": 290, "software": 291, "development": 292, "22": 293, "august": 294, "2024": 295, "bluestar": 296, "northern": 297, "star": 298, "enterprises": 299, "data": 300, "analytics": 301, "business": 302, "intelligence": 303, "09/04/2024": 304, "2025-10-21,": 305, "$175,000": 306, "$50,000": 307, "terminates": 308, "occurrence": 309, "an": 310, "default": 311, "defined": 312, "section": 313, "12.": 314, "florida,": 315, "31,": 316, "meridian": 317, "associates": 318, "apex": 319, "partners": 320, "llc": 321, "04": 322, "february": 323, "18": 324, "$250,000": 325, "$850,000": 326, "$125,000": 327, "11": 328, "eaglerock": 329, "inc.": 330, "portfolio": 331, "management;": 332, "2024-02-20": 333, "september": 334, "29,": 335, "automatically": 336, "described": 337, "herein.": 338, "commonwealth": 339, "massachusetts,": 340, "non-disclosure": 341, "09/15/2021": 342, "silverbay": 343, "advisors": 344, "23,": 345, "2021": 346, "28": 347, "april": 348, "2022,": 349, "08,": 350, "09,": 351, "17": 352, "june": 353, "2023,": 354, "2023-11-25": 355, "cascade": 356, "11/27/2023": 357, "11/23/2024,": 358, "cause": 359, "sixty": 360, "(60)": 361, "notice": 362, "2024-06-26": 363, "pacific": 364, "rim": 365, "july": 366, "03/30/2026,": 367, "delaware,": 368, "2020-10-03": 369, "technology": 370, "integration": 371, "2020-10-09": 372, "2021,": 373, "02/18/2022": 374, "redwood": 375, "equity": 376, "ironclad": 377, "technologies": 378, "corp.": 379, "strategic": 380, "market": 381, "analysis;": 382, "27,": 383, "28,": 384, "analysis": 385, "contract": 386, "ninety": 387, "(90)": 388, "30,": 389, "12,": 390, "2024-12-05,": 391, "2023-11-21": 392, "2025,": 393, "04/24/2021": 394, "04/27/2021": 395, "10": 396, "12/01/2025": 397, "12/08/2025": 398, "2026,": 399, "$500,000": 400, "14,": 401, "2020-06-18": 402, "2021-11-15,": 403, "07,": 404, "15,": 405, "2020-02-09": 406, "nexgen": 407, "2021-01-09,": 408, "01/10/2023": 409, "2023-01-25": 410, "04,": 411, "thirty": 412, "(30)": 413, "09/18/2020": 414, "06/30/2021,": 415, "2021-10-25": 416, "vantage": 417, "point": 418, "holdings": 419, "31": 420, "2022-12-15,": 421, "03": 422, "2020-03-07": 423, "2021-03-16,": 424, "24,": 425, "2024-08-30": 426, "2024-08-31": 427, "09/26/2025,": 428, "partnership": 429, "2025-04-01": 430, "04/10/2025": 431, "21": 432, "08/16/2024": 433, "02,": 434, "06/19/2026,": 435, "2022-03-26": 436, "03/31/2022": 437, "10/09/2023,": 438, "2023-12-11": 439, "2025-11-11,": 440, "12": 441, "2023-07-16": 442, "06/06/2025,": 443, "01/06/2024": 444, "2025-05-27,": 445, "02/09/2023": 446, "02/23/2023": 447, "29": 448, "2022-10-03": 449, "19": 450, "2024-04-17": 451, "04/20/2024": 452, "12/20/2025,": 453, "10,": 454, "03/18/2023": 455, "01/16/2025,": 456, "10/26/2024": 457, "2021-10-09": 458, "2021-10-17": 459, "06/14/2023,": 460, "2021-08-13": 461, "08/17/2021": 462, "07/19/2023,": 463, "2020-11-14": 464, "07": 465, "01/12/2025": 466, "01/16/2025": 467, "2027-01-12,": 468, "05/08/2022": 469, "2023-03-31,": 470, "24": 471, "2025": 472, "2025-06-29": 473, "16": 474, "19,": 475, "23": 476, "02/03/2023,": 477, "22,": 478, "25": 479, "01/28/2021,": 480, "2023-09-20": 481, "10/03/2023": 482, "06/14/2025,": 483, "05/25/2023": 484, "05/29/2023": 485, "08/09/2024,": 486, "02/11/2020": 487, "02/20/2020": 488, "03/01/2021,": 489, "01/21/2021": 490, "2021-01-23": 491, "06,": 492, "03/23/2021": 493, "04/03/2021": 494, "03,": 495, "08/15/2025": 496, "2026-07-07,": 497, "11/17/2022": 498, "11/30/2022": 499, "09/16/2023,": 500, "06/27/2021": 501, "08/22/2022,": 502, "26": 503, "2021-12-21": 504, "2022-09-03,": 505, "01/09/2022": 506, "05/13/2023,": 507, "11,": 508, "21,": 509, "10/20/2025,": 510, "05,": 511, "2025-08-25": 512, "09/03/2025": 513, "26,": 514, "2027,": 515, "2022-06-02": 516, "2020-11-07": 517, "2021-10-29,": 518, "2024-10-23": 519, "2024-11-06": 520, "2025-05-31,": 521, "2021-12-17,": 522, "2024-01-09": 523, "08/19/2024,": 524, "2020-08-18": 525, "2021-09-30,": 526, "2025-02-10": 527, "2025-12-23,": 528, "2024-09-22": 529, "2021-06-26": 530, "2022-07-04,": 531, "09/10/2025": 532, "2025-09-15": 533, "2026-03-16,": 534, "2024-06-06": 535, "16,": 536, "07/08/2023,": 537, "2025-12-03": 538, "18,": 539, "2023-02-23": 540, "2021-08-20": 541, "08/08/2022,": 542, "09/20/2023": 543, "09/22/2023": 544, "02": 545, "09/13/2025": 546, "2025-09-22": 547, "10/18/2026,": 548, "08/10/2023": 549, "01/09/2025,": 550, "03/05/2020": 551, "2020-03-08": 552, "2020-10-11": 553, "2022-05-01,": 554, "07/15/2021": 555, "2023-04-03,": 556, "05/02/2024": 557, "2025-03-31,": 558, "05/06/2020": 559, "2023-04-28": 560, "11/01/2024,": 561, "2024-08-11": 562, "04/03/2025,": 563, "01/22/2021": 564, "2022-12-25,": 565, "2021-04-26": 566, "01/20/2023,": 567, "02/24/2022,": 568, "02/18/2025": 569, "2026-09-03,": 570, "2020-08-31": 571, "01/10/2023,": 572, "2023-04-17": 573, "2024-11-14,": 574, "14": 575, "2023-12-20,": 576, "17,": 577, "2022-01-13,": 578, "2023-03-23": 579, "12/20/2023,": 580, "2024-01-22": 581, "2024-01-24": 582, "2023-04-05": 583, "27": 584, "2021-12-27": 585, "2022-01-07": 586, "20": 587, "11/06/2020": 588, "04/23/2022,": 589, "11/17/2023": 590, "11/28/2023": 591, "04/04/2021": 592, "2022-12-09": 593, "01/17/2021": 594, "01/24/2021": 595, "2022-08-15,": 596, "06": 597, "12/14/2023": 598, "2024-12-26,": 599, "08": 600, "2023-03-19,": 601, "07/08/2024": 602, "2024-07-11": 603, "2026-02-22,": 604, "05/26/2023": 605, "2023-05-31": 606, "2024-09-09,": 607, "03/13/2024,": 608, "2025-07-02": 609, "01,": 610, "2021-05-30": 611, "06/02/2021": 612, "2023-03-30,": 613, "05/07/2023": 614, "2023-05-17": 615, "01": 616, "2021-09-15": 617, "2022-04-08,": 618, "02/01/2021": 619, "03/21/2023": 620, "03/28/2023": 621, "2025-02-18": 622, "02/20/2025": 623, "03/25/2022": 624, "2022-04-06": 625, "2023-12-06,": 626, "03/16/2021": 627, "2022-03-18": 628, "2022-03-24": 629, "12/05/2023,": 630, "06/14/2022": 631, "05": 632}